const String storyText = '''
2005年，被星探發掘，隨後演出於周杰倫《楓》、劉畊宏《彩虹天堂》之歌曲影片。

2006年，主演首部電影作品《一年之初》。

2008年，與張榕容共同主演同性愛情電影《渺渺》，出演女主角渺渺。

2009年，以《艋舺》獲第十二屆臺北電影節最佳女主角提名。

2011年，在電影《雞排英雄》及偶像劇《小資女孩向前衝》中的演出，開始廣受大眾關注。其後，開始嘗試演出於不同風格之角色，如《風中家族》飾演阿玉、《五星級魚干女》飾演芳如、《目擊者》飾演徐愛婷（張老師）、《血觀音》中成年棠真等角色。

2016年，以《必娶女人》獲得第51屆電視金鐘獎戲劇節目女主角獎。

2019年，出演的電視劇《想見你》在中視、衛視中文台開播。

2020年，與傅孟柏共同主演的電影《你的情歌》、與王陽明、鄭人碩共同主演電影《海霧》、與修杰楷共同主演的電視電影《愛的詐欺犯》上映。同年以《想見你》二度獲得第55屆金鐘獎戲劇節目女主角獎。

2021年，與八三夭共同演唱《抱一抱一下》並參與其MV演出。

2022年，與比莉、賈靜雯共同主演的Netflix劇集《媽，別鬧了！》播出。同年，與鮑起靜、寇世勛共同出演的電影《一家之主》上映。

2023年，與吳慷仁共同主演的Netflix劇集《模仿犯》播出。為電影《想見你》演唱的插曲《執迷有悟》發行，同時參與作詞部分。

''';